//
// Created by 20212 on 2024/3/24.
//
#include <stdio.h>
int main(){
//    int a = 3/5;
    //c语言里面的操作符 / 整数除整数取整 只有一边有小数才会得到小数
//    printf("%d",a);
//    int a = 7 % 3;//取模必须是正数
//    printf("%d",a);
//    int a = 2;
//    int b = a << 1;
//    //把a的二进制位左移一位
//    printf("%d",b);
//    int a = -2;
//    当前的右移操作符采用的是算术右移
//    int b = a >> 1;
//    printf("%d",b);
//    右移 右边丢弃，左边补原符号位
//逻辑位移 右边丢弃,左边补0
//内存中存放的是二进制的补码
//按位操作符
//int a = 3;
//int b = 5;
//&按位与 有0则全为0,都为1才为1
//int c = a & b;
//|按位或 有真则为真 有1则为1
//int c = a | b;
//^按位异或
//对应的二进制位异或
//相同为0,相异为1
//int c = a^b;
//printf("%d",c);
//赋值语句 =叫赋值 ==叫判断
//sizeof 计算变量所占空间大小,单位是字节
//int a = 10;
//printf("%d\n",sizeof a);
//sizeof当中的表达式不参与运算
//~按位取反
//a++ 先使用再++ ++a前置++,先++再使用
int a = -1;
int b = ~a;
printf("%d\n",b);
}