//
// Created by 20212 on 3/9/2024.
//
//算术操作符
//+ - * / % ++ --
// /如果两边都是整数则返回整数，若有一个小数则返回小说 %取模，也叫取余
//移位操作符 << >>
//&按位与 |按位或 ^按位异或 ~按位取反
//a + b +有两个操作数，就是双目操作符   0为假，1为真
// 单目操作符
//#include <stdio.h>
//int main(){
////    sizeof是一个操作符
////不是函数
////计算类型或者变量的大小的 类型括号不能省略，变量类型可以省略
////int a = 10;
////
////    int a = 2;
////    a += 5;
////    int b = a;//<<移动是二进制位 整型占4个字节 32位
////    printf("b = %d\n",b);
//    int arr[10] = {0};
////    printf("%d\n",sizeof(arr[0]));//40 一个整型占4个字节，10个整型，所以是40
////    printf("%d\n",sizeof(arr));//40
//      printf("%d\n",sizeof(arr[0]));//4
//      int a = 10;
//        printf("%d\n",sizeof a);//40
//        return 0;
//
//
//}
//