//
// Created by 20212 on 3/9/2024.
//
//转义字符 转变了原来的意思
#include <stdio.h>
//int main(){
    //printf("c:\test\test.c\n");
//    printf("(??)");
//\n 转义使它换行
//    printf("c:\\test\\  \n");
//    printf("%c\n",'\'a');
//    printf在打印数据时可以指定打印的类型%d,%c,%S
//}
//\t 一个水平制表符 \v 垂直制表符 \a 响铃符 \b 退格符 \r 回车符 \f 换页符 \ddd 八进制数ddd所表示的字符 \xdd 十六进制数xdd所表示的字符
//int main(){
//    printf("%c\n",'\101');//A -65 -8进制是101
//    printf("%c\n",'\x30');//A -48 -16进制是0
    //\后接3个数字，表示8进制，\x后接2个数字，表示16进制数
//    ASCII 键盘上可以敲出的各种各样的字符，这些字符被编号，形成一个表，这个表叫做ASCII表，每个字符都有一个编号，这个编号叫做ASCII码
//  八进制里面的数字是0-7，十六进制里面的数字是0-9，a-f
//注释是用来解释复杂的代码
//}