//
// Created by 20212 on 2024/4/3.
//int main()
#include <stdio.h>
// int main(){
//    int n = 9;//4byte
//    float* pFloat = (float*) &n;//强制类型转换，只转换类型，对值不会改变
//float类型的指针访问四个字节 double8
// 字节 char1个字节
//    printf("*pFloat的值为:%f\n",*pFloat);//浮点数和整数的存入方式不一样
//
//    *pFloat = 9.0;
//    printf("%d",*pFloat);
//}
// 浮点数：5.5 - 10进制
// 二进制：101.1 --> 1.011*2^2 --> (-1)^0 * 1.011 * 2 ^ 2;
//        IEEE754，事实上M在存的时候并没有把小数点前面的1存进去，默认第一位为1，在取的时候会吧
//        S = 0 M = 1.011 E = 2;
//当e存入内存时，要加上一个中间值 32 127 64 1023
//float 32
//double
//int main(){
//    float f = 5.5f;
//    //101.1;
//    //1.011 * 2^2;
//    //s = 0;M = 011;E=2+127;
//    //0 1000 0001 0110 0000 0000 0000 0000 000
//    //40 b0 00 00
//    //浮点数存的小端
////    取出时 浮点数指数E等于值减去127或1023
////特殊情况 e = 为全0时，有效数字M不再加上前面第一位的1，而是还原为0.xxxxx的小数，这样做是为了表示0，以及接近0的很小的数字
//如果发现e为全0，不用补1而是直接写0.xxx
////e为全1，表示正负无穷大（正负取决于符号位s）
//    return 0;
//}
