//
// Created by 20212 on 2024/4/2.
//
//int main(){
//    int arr[10] = {0};
//    void 一般用于函数的返回类型 void test(); 函数参数 test(void);
//   数据在内存中以2进制的形式存储
//对于整数来说
//整数在二进制中有3中形式 ：原码，反码，补码
//正整数：原码反码补码相同
//    int a = -10;
//    return 0;
//整数在内存中存的是补码
//cpu上面只有加法器，没有减法器
//大端字节序和小端字节序
//小端字节序 把数据的低位字节序的内容存放在低地址中，高位字节序放在高地址中
//大端字节序  把数据的低位字节序的内容放在高地址中，高位字节序放在低地址中
//int main(){
//    int a = 0x11223344;
//    当前编译器采用小端字节序
//    return 0;
//内存在地址中是二进制
//}
#include <stdio.h>
//int main(){
////内存地址是由低到高的
//    int a = 1;
//    char *p = (char*) &a;//取地址a取出来的是整型的地址，所以需要强制类型转换
//    printf("%c\n",*p);
//    printf("%d\n",*p);
//    printf("%d\n",0x11);
//    if(*p == 1){
//        printf("小端");
//    }else printf("大端");
//return 0;
//}
//int main(){
//    char a = -1;//10000000 00000000 00000000 00000001
//    signed char b = -1;
//// 有符号位整型提升，高位填充原符号位
////无符号位整型提升，高位填充0
//    unsigned char c = -1;
//    printf("a=%d,b=%d,c=%d",a,b,c);
//    a = -1，b = -1，
//char 到底是signed char还是unsigned char，c语言并没有规定，取决于编译器
//    char a = 128;
////    整型提升按原来的符号位补到高位提升
//    printf("%u\n",a);
//10000000 -128 有符号char取值 -128到128
//}